1s/ERP/Conf/Documents/Лико_ПолучениеГПИзПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПолучениеГПИзПроизводства</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>оставил как служебный реквизит для префиксации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СостоянияЗаявокНаТранспортировку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СостоянияЗаявокНаТранспортировку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СостоянияЗаявокНаТранспортировку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПеремещениеПаллета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПеремещениеПаллета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_ПланированиеУпаковки</xr:Item>
				<xr:Item>InformationRegister.Лико_АдресноеХранение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРастарки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ПричиныРастарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Содержимое</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбылСоСклада</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаказыНаРастарку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЦепочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоИсходнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Намотка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЭтикеткиЗаказчика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_НомераПоставок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧестныйЗнак</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ЧестныйЗнак</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПолучениеГПИзПроизводства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Площадка) Тогда
			Объект.Площадка = Лико_Дополнительно.ПлощадкаПользователяПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	Элементы.ТоварыКоличество.ТолькоПросмотр = НЕ ПолныеПрава;
	Если Объект.Состояние = Перечисления.Лико_СостоянияЗаявокНаТранспортировку.Закрыт И Объект.Проведен И НЕ ПолныеПрава Тогда
		ТолькоПросмотр = Истина;
		Сообщить("Документ уже закрыт, изменения разрешены только под полными правами");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаказыКлиентовВТЧТовары()
	
	// Заполним доп. реквизит ТЧ Товары ЗаказКлиента
	Для каждого Строка из Объект.Товары Цикл
		Строка.ЗаказКлиента = Строка.Характеристика.Лико_ЗаказНоменклатуры;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдСтроки", Элементы.Товары.ТекущаяСтрока);
	Если Поле.Имя = "ТоварыЗаказКлиентаНомерБезПрефикса" Тогда
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ВведенНомерЗаказа", ЭтотОбъект, ДопПараметры),, "Введите номер заказа", 7, Ложь);
	ИначеЕсли Поле.Имя = "ТоварыХарактеристикаВладелец" Тогда
		Заказ = Элементы.Товары.ТекущиеДанные.ЗаказКлиента;
		Если НЕ ЗначениеЗаполнено(Заказ) Тогда
			Сообщить("Сначала нужно выбрать заказ");
			Возврат;
		КонецЕсли;
		ДопПараметры.Вставить("Заказ", Заказ);
		ДопПараметры.Вставить("РежимВыбора", "Множественный");
		ОткрытьФорму("Документ.Лико_ПеремещениеПаллета.Форма.ФормаВыбраНоменклатуры", ДопПараметры, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("ВыбранаНоменклатура", ЭтотОбъект, ДопПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВведенНомерЗаказа(НомерЗаказа, ДопПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(НомерЗаказа) Тогда
		//Сообщить("Заказ не выбран");
		Возврат;
	КонецЕсли;

	Модифицированность = Истина;
	
	Заказ = Лико_Дополнительно.НайтиДокументПоНомеру7Символов(НомерЗаказа, "ЗаказКлиента");
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		Сообщить("Не найден заказ с номером " + НомерЗаказа);
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Сообщить("Ошибка: не удалось найти строку, для которой производился выбор заказа");
		Возврат;
	КОнецЕсли;
	ТекущаяСтрока.ЗаказКлиента = Заказ;

	ДопПараметры.Вставить("Заказ", Заказ);
	РезультатФункции = ПроверитьНеобходимостьВыбораНоменклатуры(Заказ);
	Если РезультатФункции.НеобходимВыборНоменклатуры Тогда
		// Нужно выбрать номенклатуру
		ДопПараметры.Вставить("РежимВыбора", "Множественный");
		ОткрытьФорму("Документ.Лико_ПеремещениеПаллета.Форма.ФормаВыбраНоменклатуры", ДопПараметры, ЭтаФорма, Новый УникальныйИдентификатор,,, Новый ОписаниеОповещения("ВыбранаНоменклатура", ЭтотОбъект, ДопПараметры), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ВыбранаНоменклатура(РезультатФункции.ВыбранноеЗначение, ДопПараметры);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНеобходимостьВыбораНоменклатуры(Заказ)
	
	СтруктураВозврата = Новый Структура("НеобходимВыборНоменклатуры,ВыбранноеЗначение", Истина);
	Если Заказ.Товары.Количество() = 1 Тогда
		СтруктураВозврата.НеобходимВыборНоменклатуры = Ложь; 
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(Новый Структура("Характеристика,Количество", Заказ.Товары[0].Характеристика, Заказ.Товары[0].Количество));
		СтруктураВозврата.ВыбранноеЗначение = Новый Структура("МассивСтрок", МассивСтрок);
	КонецЕсли;
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ВыбранаНоменклатура(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		//Сообщить("Номенклатура не выбрана");
		Возврат;
	КонецЕсли;
	
	ВыбранаНоменклатураНаСервере(ВыбранноеЗначение, ДопПараметры);
	
	Если ВыбранноеЗначение.МассивСтрок.Количество() > 1 Тогда
		Элементы.Товары.ТекущаяСтрока = Объект.Товары[Объект.Товары.Количество()-1].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыбранаНоменклатураНаСервере(ВыбранноеЗначение, ДопПараметры)
	
	Модифицированность = Истина;
	ПерваяСтрока = Истина;
	Для каждого ЭлементСтруктуры из ВыбранноеЗначение.МассивСтрок Цикл
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Характеристика", ЭлементСтруктуры.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Если ПерваяСтрока Тогда
				ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ДопПараметры.ИдСтроки);
				Если ТекущаяСтрока = Неопределено Тогда
					Сообщить("Ошибка: не удалось найти строку, для которой производился выбор заказа и номенклатуры");
					Возврат;
				КонецЕсли;
				
				ТекущаяСтрока.Характеристика = ЭлементСтруктуры.Характеристика;
				//Если ТекущаяСтрока.Количество <> 0 И ТекущаяСтрока.Количество <> ЭлементСтруктуры.Количество Тогда
				//	Сообщить("Количество в строке №" + ТекущаяСтрока.НомерСтроки + " перезаполнено из заказа");
				//КонецЕсли;
				//ТекущаяСтрока.Количество = ЭлементСтруктуры.Количество;
				ТекущаяСтрока.Количество = 1;
				ПерваяСтрока = Ложь;
			Иначе
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементСтруктуры);
				НоваяСтрока.ЗаказКлиента = НоваяСтрока.Характеристика.Лико_ЗаказНоменклатуры;
				НоваяСтрока.Количество = 1;
			КонецЕсли;
		Иначе
			ТекущаяСтрока = НайденныеСтроки[0];
			Сообщить("" + ЭлементСтруктуры.Характеристика.Владелец + " / " + ЭлементСтруктуры.Характеристика + " уже содержится в документе (строка №" + ТекущаяСтрока.НомерСтроки + ")");
			//Если ТекущаяСтрока.Количество <> ЭлементСтруктуры.Количество Тогда
			//	ТекущаяСтрока.Количество = ЭлементСтруктуры.Количество;
			//	Сообщить("Количество в строке №" + ТекущаяСтрока.НомерСтроки + " перезаполнено из заказа");
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	НоваяСтрока = Объект.Товары.Добавить();
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдСтроки", НоваяСтрока.ПолучитьИдентификатор());
	
	Элементы.Товары.ТекущаяСтрока = ДопПараметры.ИдСтроки;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВведенНомерЗаказа", ЭтотОбъект, ДопПараметры),, "Введите номер заказа", 7, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьЗаказыКлиентовВТЧТовары();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьЗаказыКлиентовВТЧТовары();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ТиповыеДокументы.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	Элементы.ТиповыеДокументы.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ТиповойДокумент) Тогда
		ПоказатьЗначение(,Элемент.ТекущиеДанные.ТиповойДокумент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказ(Команда)
	
	Если Элементы.Товары.ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ЗаказКлиента) Тогда
		ПоказатьЗначение(, Элементы.Товары.ТекущиеДанные.ЗаказКлиента);
	КонецЕсли;
	
КонецПроцедуры
